bouffalolab/bouffalo_sdk/drivers/bl702_driver/hal_drv/src/hal_pm.c
#if PM_PDS_PLL_POWER_OFF
    PDS_Power_Off_PLL();
#endif
#if PM_PDS_DLL_POWER_OFF
    GLB_Set_System_CLK(GLB_DLL_XTAL_NONE, GLB_SYS_CLK_RC32M);
    AON_Power_Off_XTAL();
    GLB_Power_Off_DLL();
    PDS_Update_Flash_Ctrl_Setting(0);
#endif

    /* pds0-pds7 : ldo11rt_iload_sel=3 */
    /* pds31     : ldo11rt_iload_sel=1 */
    if ((pds_level >= 0) && (pds_level <= 7)) {
        HBN_Set_Ldo11rt_Drive_Strength(HBN_LDO11RT_DRIVE_STRENGTH_25_250UA);
    } else if (pds_level == PM_PDS_LEVEL_31) {
        HBN_Set_Ldo11rt_Drive_Strength(HBN_LDO11RT_DRIVE_STRENGTH_10_100UA);
    } else {
        /* pdsLevel error */
    }

    pPdsCfg->pdsCtl.pdsLdoVol = PM_PDS_LDO_LEVEL_DEFAULT;
    pPdsCfg->pdsCtl.pdsLdoVselEn = 1;

#if PM_PDS_GPIO_IE_PUPD == 0
    pPdsCfg->pdsCtl.gpioIePuPd = 0;
#endif

#if PM_PDS_RF_POWER_OFF == 0
    pPdsCfg->pdsCtl.pdsCtlRfSel = 0;
#endif
    /* config  ldo11soc_sstart_delay_aon =2 , cr_pds_pd_ldo11=0 to speedup ldo11soc_rdy_aon */
    AON_Set_LDO11_SOC_Sstart_Delay(0x2);

    PDS_Default_Level_Config(pPdsCfg, sleep_time);
    if (store_flag) {
        __asm__ __volatile__(
            "csrr   a0,     mtvec\n\t"
            "csrr   a1,     mstatus\n\t"
            "la     a2,     __ld_pds_bak_addr\n\t"
            "sw     sp,     1*4(a2)\n\t"
            "sw     tp,     2*4(a2)\n\t"
            "sw     t0,     3*4(a2)\n\t"
            "sw     t1,     4*4(a2)\n\t"
            "sw     t2,     5*4(a2)\n\t"
            "sw     fp,     6*4(a2)\n\t"
            "sw     s1,     7*4(a2)\n\t"
            "sw     a0,     8*4(a2)\n\t"
            "sw     a1,     9*4(a2)\n\t"
            "sw     a3,     10*4(a2)\n\t"
            "sw     a4,     11*4(a2)\n\t"
            "sw     a5,     12*4(a2)\n\t"
            "sw     a6,     13*4(a2)\n\t"
            "sw     a7,     14*4(a2)\n\t"
            "sw     s2,     15*4(a2)\n\t"
            "sw     s3,     16*4(a2)\n\t"
            "sw     s4,     17*4(a2)\n\t"
            "sw     s5,     18*4(a2)\n\t"
            "sw     s6,     19*4(a2)\n\t"
            "sw     s7,     20*4(a2)\n\t"
            "sw     s8,     21*4(a2)\n\t"
            "sw     s9,     22*4(a2)\n\t"
            "sw     s10,    23*4(a2)\n\t"
            "sw     s11,    24*4(a2)\n\t"
            "sw     t3,     25*4(a2)\n\t"
            "sw     t4,     26*4(a2)\n\t"
            "sw     t5,     27*4(a2)\n\t"
            "sw     t6,     28*4(a2)\n\t");
    }
    pm_pds_enter_done(store_flag);

#if PM_PDS_PLL_POWER_OFF
    GLB_Set_System_CLK(XTAL_TYPE, BSP_ROOT_CLOCK_SOURCE);
    PDS_Update_Flash_Ctrl_Setting(1);
#endif

#if PM_PDS_FLASH_POWER_OFF
    if (pds_level < PM_PDS_LEVEL_4) {
        HBN_Set_Pad_23_28_Pullnone();
        /* Init flash gpio */
        SF_Cfg_Init_Flash_Gpio(0, 1);

        SF_Ctrl_Set_Owner(SF_CTRL_OWNER_SAHB);
        SFlash_Restore_From_Powerdown(flash_cfg, 0);
    }
#endif

    cpu_global_irq_enable();

    if (store_flag) {
        // Get cache way disable setting
        *(volatile uint32_t *)(L1C_BASE + 0x00) &= ~(0x0F < 8);
        *(volatile uint32_t *)(L1C_BASE + 0x00) |= cacheWayDisable;

        // Get psram io configuration
        *(volatile uint32_t *)(GLB_BASE + 0x88) = psramIoCfg;
    }
}
/**
 * @brief
 *
 * power management in hbn(hibernation) mode
 * cpu will reset after wakeup
 *
 * HBN_LEVEL   PD_AON       PD_AON_HNBRTC        PD_AON_HBNCORE        PD_CORE     PD_CORE_MISC_DIG    PD_CORE_MISC_ANA    PD_CORE_CPU     PD_BZ   PD_USB
 * HBN0          ON               ON                  ON                OFF            OFF                  OFF                 OFF         OFF     OFF
 * HBN1          ON               ON                  OFF               OFF            OFF                  OFF                 OFF         OFF     OFF
 * HBN2          ON               OFF                 OFF               OFF            OFF                  OFF                 OFF         OFF     OFF
 * @param hbn_level
 */
ATTR_TCM_SECTION void pm_hbn_mode_enter(enum pm_hbn_sleep_level hbn_level, uint8_t sleep_time)
{
    uint32_t tmpVal;

    /* To make it simple and safe*/
    cpu_global_irq_disable();

    CPU_Interrupt_Pending_Clear(HBN_OUT0_IRQn);
    CPU_Interrupt_Pending_Clear(HBN_OUT1_IRQn);

    BL_WR_REG(HBN_BASE, HBN_IRQ_CLR, 0xffffffff);
    BL_WR_REG(HBN_BASE, HBN_IRQ_CLR, 0);

    if (sleep_time && (hbn_level < PM_HBN_LEVEL_2))
        rtc_init(sleep_time); //sleep time,unit is second

    if (hbn_level >= PM_HBN_LEVEL_2)
        HBN_Power_Off_RC32K();
    else
        HBN_Power_On_RC32K();

    HBN_Power_Down_Flash(NULL);
    /* SF io select from efuse value */
    uint32_t flash_select = BL_RD_WORD(0x40007074);
    if (((flash_select >> 26) & 7) == 0) {
        HBN_Set_Pad_23_28_Pullup();
    }

    /* Select RC32M */
    GLB_Set_System_CLK(GLB_DLL_XTAL_NONE, GLB_SYS_CLK_RC32M);
    /* power off xtal */
    AON_Power_Off_XTAL();
    GLB_Power_Off_DLL();
    PDS_Power_Off_PLL();

    /* HBN mode LDO level */
    tmpVal = BL_RD_REG(HBN_BASE, HBN_CTL);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, HBN_LDO11_AON_VOUT_SEL, PM_HBN_LDO_LEVEL_DEFAULT);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, HBN_LDO11_RT_VOUT_SEL, PM_HBN_LDO_LEVEL_DEFAULT);
    BL_WR_REG(HBN_BASE, HBN_CTL, tmpVal);

    /* Set HBN flag */
    BL_WR_REG(HBN_BASE, HBN_RSV0, HBN_STATUS_ENTER_FLAG);

    tmpVal = BL_RD_REG(HBN_BASE, HBN_CTL);

    /* Set HBN level, (HBN_PWRDN_HBN_RAM not use) */
    switch (hbn_level) {
        case PM_HBN_LEVEL_0:
            tmpVal = BL_CLR_REG_BIT(tmpVal, HBN_PWRDN_HBN_CORE);
            tmpVal = BL_CLR_REG_BIT(tmpVal, HBN_PWRDN_HBN_RTC);
            break;

        case PM_HBN_LEVEL_1:
            tmpVal = BL_SET_REG_BIT(tmpVal, HBN_PWRDN_HBN_CORE);
            tmpVal = BL_CLR_REG_BIT(tmpVal, HBN_PWRDN_HBN_RTC);
            break;

        case PM_HBN_LEVEL_2:
            tmpVal = BL_SET_REG_BIT(tmpVal, HBN_PWRDN_HBN_CORE);
            tmpVal = BL_SET_REG_BIT(tmpVal, HBN_PWRDN_HBN_RTC);
            break;
        default:
            break;
    }

    /* Set power on option:0 for por reset twice for robust 1 for reset only once*/
    tmpVal = BL_CLR_REG_BIT(tmpVal, HBN_PWR_ON_OPTION);
    BL_WR_REG(HBN_BASE, HBN_CTL, tmpVal);

    /* Enable HBN mode */
    tmpVal = BL_RD_REG(HBN_BASE, HBN_CTL);
    tmpVal = BL_SET_REG_BIT(tmpVal, HBN_MODE);
    BL_WR_REG(HBN_BASE, HBN_CTL, tmpVal);

    while (1) {
        BL702_Delay_MS(1000);
    }
}

void pm_set_wakeup_callback(void (*wakeup_callback)(void))
{
    BL_WR_REG(HBN_BASE, HBN_RSV1, (uint32_t)wakeup_callback);
    /* Set HBN flag */
    BL_WR_REG(HBN_BASE, HBN_RSV0, HBN_STATUS_ENTER_FLAG);
}

